<a href="https://colab.research.google.com/github/KrishnaPandya-VGEC-IT/Data-Science/blob/main/Pandas_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Basics**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Creating dataframe

df = pd.DataFrame({
    'Enrollment': [1, 2, 3, 4, 5],

    'Name' : ['Ramesh', 'Suresh', 'Meet', 'Pratik', 'Rutvik'],

    'Department' : ['CE', 'IT', 'EE','EC', 'CI'],

    'CGPA' : [7.5, 8.1, 9.33, 6.56, 8.55]
},columns = ['Enrollment', 'Name', 'Department', 'CGPA'])

df

   Enrollment    Name Department  CGPA
0           1  Ramesh         CE  7.50
1           2  Suresh         IT  8.10
2           3    Meet         EE  9.33
3           4  Pratik         EC  6.56
4           5  Rutvik         CI  8.55

In [ ]:
df.columns #will print column names

Index(['Enrollment', 'Name', 'Department', 'CGPA'], dtype='object')

In [ ]:
df.index = ['First', 'Second', 'Third', 'Forth', 'Fifth'] #Gives indeces to rows

df.index

Index(['First', 'Second', 'Third', 'Forth', 'Fifth'], dtype='object')

In [ ]:
df.info() # Prints basic information about datatypes of columns

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, First to Fifth
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Enrollment  5 non-null      int64
 1   Name        5 non-null      object
 2   Department  5 non-null      object
 3   CGPA        5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 200.0+ bytes

In [ ]:
df.size  #Total number of elements in table

20

In [ ]:
df.shape #(rows, columns) for this example. Otherwise depends upon dimension.

(5, 4)

In [ ]:
df.describe() # Gives basic functions like min, max, std, 25%, 50%, 75% for numeric columns.

       Enrollment      CGPA
count    5.000000  5.000000
mean     3.000000  8.008000
std      1.581139  1.049366
min      1.000000  6.560000
25%      2.000000  7.500000
50%      3.000000  8.100000
75%      4.000000  8.550000
max      5.000000  9.330000

In [ ]:
df.dtypes   # prints datatypes of each and every column

Enrollment      int64
Name           object
Department     object
CGPA          float64
dtype: object

In [ ]:
df.dtypes.value_counts()  # Counts datatype values. i.e., int64 - 2 and float64 - 1

object     2
float64    1
int64      1
dtype: int64

**Indexing, Selection and Slicing**

In [ ]:
df  #prints dataframe

        Enrollment    Name Department  CGPA
First            1  Ramesh         CE  7.50
Second           2  Suresh         IT  8.10
Third            3    Meet         EE  9.33
Forth            4  Pratik         EC  6.56
Fifth            5  Rutvik         CI  8.55

In [ ]:
df.loc['Third'] #Find row by index name

Enrollment       3
Name          Meet
Department      EE
CGPA          9.33
Name: Third, dtype: object

In [ ]:
df.iloc[1] # Find row by index number

Enrollment         2
Name          Suresh
Department        IT
CGPA             8.1
Name: Second, dtype: object

In [ ]:
df.iloc[-1] # Last row of df

Enrollment         5
Name          Rutvik
Department        CI
CGPA            8.55
Name: Fifth, dtype: object

In [ ]:
df['Department'] # To print column with name 'Department'

First     CE
Second    IT
Third     EE
Forth     EC
Fifth     CI
Name: Department, dtype: object

In [ ]:
df['Department'].to_frame() # To print column in form of dataframe

       Department
First          CE
Second         IT
Third          EE
Forth          EC
Fifth          CI

In [ ]:
df[['Name','CGPA']] # prints two columns

          Name  CGPA
First   Ramesh  7.50
Second  Suresh  8.10
Third     Meet  9.33
Forth   Pratik  6.56
Fifth   Rutvik  8.55

In [ ]:
df[1:3] # Rows with index 1,2

        Enrollment    Name Department  CGPA
Second           2  Suresh         IT  8.10
Third            3    Meet         EE  9.33

In [ ]:
df.loc['Third'] # Index with name 'Third'

Enrollment       3
Name          Meet
Department      EE
CGPA          9.33
Name: Third, dtype: object

In [ ]:
df.loc['Third':'Fifth'] # index with names 'Third' to 'Fifth'

       Enrollment    Name Department  CGPA
Third           3    Meet         EE  9.33
Forth           4  Pratik         EC  6.56
Fifth           5  Rutvik         CI  8.55

In [ ]:
df.loc['Third':'Fifth',['Department','CGPA']] # three rows with only two columns

      Department  CGPA
Third         EE  9.33
Forth         EC  6.56
Fifth         CI  8.55

In [ ]:
df.iloc[-1] #last row

Enrollment         5
Name          Rutvik
Department        CI
CGPA            8.55
Name: Fifth, dtype: object

In [ ]:
df.iloc[[0,1,-1]] # three rows with numeric indeces 0,1,-1

        Enrollment    Name Department  CGPA
First            1  Ramesh         CE  7.50
Second           2  Suresh         IT  8.10
Fifth            5  Rutvik         CI  8.55

In [ ]:
df.iloc[1:3] # two rows with indeces 1,2 (Third is excluded)

        Enrollment    Name Department  CGPA
Second           2  Suresh         IT  8.10
Third            3    Meet         EE  9.33

In [ ]:
df.iloc[1:3,2] # rows with indeces 1,2 and column index 2

Second    IT
Third     EE
Name: Department, dtype: object

In [ ]:
df.iloc[1:3,[0,3]] # two rows with column indeces 0 and 3

        Enrollment  CGPA
Second           2  8.10
Third            3  9.33

In [ ]:
df.iloc[1:3, 1:3] # index 1 and 2 row as well as same columns

          Name Department
Second  Suresh         IT
Third     Meet         EE

**Conditional Selection (Boolean Arrays):**

In [ ]:
df #Prints Dataframe

        Enrollment    Name Department  CGPA
First            1  Ramesh         CE  7.50
Second           2  Suresh         IT  8.10
Third            3    Meet         EE  9.33
Forth            4  Pratik         EC  6.56
Fifth            5  Rutvik         CI  8.55

In [ ]:
df['CGPA']>8  #Gives true if CGPA>8 (with index row only)

First     False
Second     True
Third      True
Forth     False
Fifth      True
Name: CGPA, dtype: bool

In [ ]:
df.loc[df['CGPA']>8] # Gives whole row

        Enrollment    Name Department  CGPA
Second           2  Suresh         IT  8.10
Third            3    Meet         EE  9.33
Fifth            5  Rutvik         CI  8.55

In [ ]:
df.loc[df['CGPA']>8, ['Name']] # Same condition with one column only

          Name
Second  Suresh
Third     Meet
Fifth   Rutvik

In [ ]:
df.loc[df['CGPA']>8,['Name','CGPA']] # with two columns

          Name  CGPA
Second  Suresh  8.10
Third     Meet  9.33
Fifth   Rutvik  8.55

**Dropping Stuff**

In [ ]:
df.drop('Second') # row having 'Second' index

       Enrollment    Name Department  CGPA
First           1  Ramesh         CE  7.50
Third           3    Meet         EE  9.33
Forth           4  Pratik         EC  6.56
Fifth           5  Rutvik         CI  8.55

In [ ]:
df.drop(['Second','Third']) # 2 rows

       Enrollment    Name Department  CGPA
First           1  Ramesh         CE  7.50
Forth           4  Pratik         EC  6.56
Fifth           5  Rutvik         CI  8.55

In [ ]:
df.drop(columns = ['Department','Enrollment']) # 2 columns

          Name  CGPA
First   Ramesh  7.50
Second  Suresh  8.10
Third     Meet  9.33
Forth   Pratik  6.56
Fifth   Rutvik  8.55

In [ ]:
df.drop(['First','Second'],axis = 0) #means row-wise.(By default axis is already 0. It is not needed to write)

       Enrollment    Name Department  CGPA
Third           3    Meet         EE  9.33
Forth           4  Pratik         EC  6.56
Fifth           5  Rutvik         CI  8.55

In [ ]:
df.drop(['Department','Enrollment'],axis = 1) # We removed columns and added axis = 1

          Name  CGPA
First   Ramesh  7.50
Second  Suresh  8.10
Third     Meet  9.33
Forth   Pratik  6.56
Fifth   Rutvik  8.55

In [ ]:
df.drop(['First','Second'], axis = 'rows') # alternative to axis = 0

       Enrollment    Name Department  CGPA
Third           3    Meet         EE  9.33
Forth           4  Pratik         EC  6.56
Fifth           5  Rutvik         CI  8.55

In [ ]:
df.drop(['Department','Enrollment'], axis = 'columns') # same as axis = 1

          Name  CGPA
First   Ramesh  7.50
Second  Suresh  8.10
Third     Meet  9.33
Forth   Pratik  6.56
Fifth   Rutvik  8.55

**Operations**

In [ ]:
df[['Enrollment','Department']] # Two columns

        Enrollment Department
First            1         CE
Second           2         IT
Third            3         EE
Forth            4         EC
Fifth            5         CI

In [ ]:
df['CGPA']*10  # Multiplication of column

First     75.0
Second    81.0
Third     93.3
Forth     65.6
Fifth     85.5
Name: CGPA, dtype: float64

In [ ]:
crisis = pd.Series([4.5],index= ['CGPA'])  # New series
crisis

CGPA    4.5
dtype: float64

**Modifying dataframes**

In [ ]:
# Adding a new column

points = pd.Series([70,88,49,71,63],name='Points')

df['Points'] = points.values

df

        Enrollment    Name Department  CGPA  Points
First            1  Ramesh         CE  7.50      70
Second           2  Suresh         IT  8.10      88
Third            3    Meet         EE  9.33      49
Forth            4  Pratik         EC  6.56      71
Fifth            5  Rutvik         CI  8.55      63

In [ ]:
# New column with same values

df['Language'] = 'English'

df

        Enrollment    Name Department  CGPA  Points Language
First            1  Ramesh         CE  7.50      70  English
Second           2  Suresh         IT  8.10      88  English
Third            3    Meet         EE  9.33      49  English
Forth            4  Pratik         EC  6.56      71  English
Fifth            5  Rutvik         CI  8.55      63  English

In [ ]:
# Renaming columns

df.rename(
    columns = {'Name':'Full Name',
               'Enrollment':'Number'},
    
    index = {'First':'01',
             'Second':'02',
             'Third':'03',
             'Forth':'04',
             'Fifth':'05'}) # This will not modify original dataframe

    Number Full Name Department  CGPA  Points Language
01       1    Ramesh         CE  7.50      70  English
02       2    Suresh         IT  8.10      88  English
03       3      Meet         EE  9.33      49  English
04       4    Pratik         EC  6.56      71  English
05       5    Rutvik         CI  8.55      63  English

In [ ]:
df.rename(index=str.upper) # Convert index Strings to upper

        Enrollment    Name Department  CGPA  Points Language
FIRST            1  Ramesh         CE  7.50      70  English
SECOND           2  Suresh         IT  8.10      88  English
THIRD            3    Meet         EE  9.33      49  English
FORTH            4  Pratik         EC  6.56      71  English
FIFTH            5  Rutvik         CI  8.55      63  English

In [ ]:
df.rename(index = lambda x:x.lower()) # Convert index string to lower using function

        Enrollment    Name Department  CGPA  Points Language
first            1  Ramesh         CE  7.50      70  English
second           2  Suresh         IT  8.10      88  English
third            3    Meet         EE  9.33      49  English
forth            4  Pratik         EC  6.56      71  English
fifth            5  Rutvik         CI  8.55      63  English

*Dropping Columns*

In [ ]:
df.drop(columns = 'Enrollment', inplace = True) # will modify original data frame

In [ ]:
df

          Name Department  CGPA  Points Language
First   Ramesh         CE  7.50      70  English
Second  Suresh         IT  8.10      88  English
Third     Meet         EE  9.33      49  English
Forth   Pratik         EC  6.56      71  English
Fifth   Rutvik         CI  8.55      63  English

*Adding Values*

In [ ]:
df.append(pd.Series({'Name' : 'Parth',
                     'Department' : 'ME',
                     'CGPA':'9.2',
                     'Language':'Hindi'},
                    name= 'Sixth')) # will create another dataframe. [Not modifies original df]

          Name Department  CGPA  Points Language
First   Ramesh         CE   7.5    70.0  English
Second  Suresh         IT   8.1    88.0  English
Third     Meet         EE  9.33    49.0  English
Forth   Pratik         EC  6.56    71.0  English
Fifth   Rutvik         CI  8.55    63.0  English
Sixth    Parth         ME   9.2     NaN    Hindi

In [ ]:
df

          Name Department  CGPA  Points Language
First   Ramesh         CE  7.50      70  English
Second  Suresh         IT  8.10      88  English
Third     Meet         EE  9.33      49  English
Forth   Pratik         EC  6.56      71  English
Fifth   Rutvik         CI  8.55      63  English

In [ ]:
# df.loc will modify original df and can be used to append data.

df.loc['Sixth'] = pd.Series({
    'Name' : 'Parth',
    'Department' : 'ME',
    'CGPA':'9.2',
    'Language':'Hindi'
})

In [ ]:
df

          Name Department  CGPA  Points Language
First   Ramesh         CE   7.5    70.0  English
Second  Suresh         IT   8.1    88.0  English
Third     Meet         EE  9.33    49.0  English
Forth   Pratik         EC  6.56    71.0  English
Fifth   Rutvik         CI  8.55    63.0  English
Sixth    Parth         ME   9.2     NaN    Hindi

In [ ]:
df.drop('Sixth', inplace = True) # Will permanently change df.
df

          Name Department  CGPA  Points Language
First   Ramesh         CE   7.5    70.0  English
Second  Suresh         IT   8.1    88.0  English
Third     Meet         EE  9.33    49.0  English
Forth   Pratik         EC  6.56    71.0  English
Fifth   Rutvik         CI  8.55    63.0  English

**Creating columns from another columns**

In [ ]:
df[['Name','CGPA','Points']]

          Name  CGPA  Points
First   Ramesh   7.5    70.0
Second  Suresh   8.1    88.0
Third     Meet  9.33    49.0
Forth   Pratik  6.56    71.0
Fifth   Rutvik  8.55    63.0

In [ ]:
df['CGPA']/df['Points']

First      0.107143
Second    0.0920455
Third      0.190408
Forth     0.0923944
Fifth      0.135714
dtype: object

In [ ]:
df ['Rating'] = (df['CGPA'] * 10 + df['Points'])/2
df

          Name Department  CGPA  Points Language Rating
First   Ramesh         CE   7.5    70.0  English   72.5
Second  Suresh         IT   8.1    88.0  English   84.5
Third     Meet         EE  9.33    49.0  English  71.15
Forth   Pratik         EC  6.56    71.0  English   68.3
Fifth   Rutvik         CI  8.55    63.0  English  74.25

**Statistical Information**

In [ ]:
df.head()

          Name Department  CGPA  Points Language Rating
First   Ramesh         CE   7.5    70.0  English   72.5
Second  Suresh         IT   8.1    88.0  English   84.5
Third     Meet         EE  9.33    49.0  English  71.15
Forth   Pratik         EC  6.56    71.0  English   68.3
Fifth   Rutvik         CI  8.55    63.0  English  74.25

In [ ]:
df.describe()

          Points
count   5.000000
mean   68.200000
std    14.131525
min    49.000000
25%    63.000000
50%    70.000000
75%    71.000000
max    88.000000

In [ ]:
cgpa = df['CGPA']

In [ ]:
print("min cgpa : ",cgpa.min())
print("max cgpa : ",cgpa.max())
print("length of it : ",len(cgpa))
print("sum of it : ",cgpa.sum())
print("standard deviation : ",cgpa.std())
print("Mean of it : ",cgpa.mean())
print("Median of it : ",cgpa.median())

min cgpa :  6.56
max cgpa :  9.33
length of it :  5
sum of it :  40.04
standard deviation :  1.0493664755460794
Mean of it :  8.008
Median of it :  8.1

In [ ]:
cgpa.describe()

count     5.0
unique    5.0
top       7.5
freq      1.0
Name: CGPA, dtype: float64

In [ ]:
cgpa.quantile(.25) # at 25% percentile which value is it

7.5

In [ ]:
cgpa.quantile([.2, .4, .6, .8, 1])

0.2    7.312
0.4     7.86
0.6     8.28
0.8    8.706
1.0     9.33
Name: CGPA, dtype: object